{
  "backend/main.mo": "Defines an empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Contains metadata describing the feature change removing the disclaimer text from the landing page footer and its related files and components.",
  "frontend-file-summaries.txt": "Lists pre-generated summaries for all frontend files in the project.",
  "frontend/index.css": "Root Tailwind CSS variables and base styles defining light/dark themes and core design tokens.",
  "frontend/index.html": "Basic HTML shell that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component composing all landing page sections, sticky header, footer, and mobile CTA bar.",
  "frontend/src/components/CtaButton.tsx": "Reusable Buy Now CTA button linking to the affiliate URL with size variants and hover effects.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright and caffeine.ai attribution with tracking parameters.",
  "frontend/src/components/MobileStickyCtaBar.tsx": "Mobile-only sticky bottom bar containing a full-width CTA button.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Section listing six digestive support benefits with icons, an image, and a CTA button.",
  "frontend/src/components/sections/FaqSection.tsx": "Accordion-style FAQ list with eight expandable questions and answers.",
  "frontend/src/components/sections/FinalCtaSection.tsx": "Final CTA section with urgency messaging, product image, and large Buy Now button.",
  "frontend/src/components/sections/FormulaSection.tsx": "Renders a section showcasing GutOptim’s key ingredients with icons and an image.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the hero banner with headline, benefits, CTA button, and product image.",
  "frontend/src/components/sections/ProblemSolutionSection.tsx": "Presents common digestive issues and positions GutOptim as a supportive solution with an image and CTA.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Lists customer testimonials with star ratings, supporting imagery, and a CTA button.",
  "frontend/src/components/sections/TrustQualitySection.tsx": "Shows trust badges for quality, security, facility, and shipping along with a supporting image.",
  "frontend/src/components/StickyHeader.tsx": "Sticky top navigation bar with logo, smooth-scroll menu, mobile menu, and CTA button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using React Query and Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login, and stored identities.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and utility classes for layout and component styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrapping the root component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom color tokens, container settings, animations, and typography/container-query plugins.",
  "project_state.json": "Defines project state and requirements for building a GutOptim affiliate landing page, including design rules, CTA behavior, and section specifications."
}