{
  "backend/main.mo": "Empty Motoko actor defining no backend logic.",
  "feature_evidence.json": "JSON report mapping implemented features to involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend files and components.",
  "frontend/index.css": "Tailwind base layer with OKLCH theme variables, light/dark modes, and global styles.",
  "frontend/index.html": "Root HTML document loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component assembling all landing page sections with header and mobile CTA bar.",
  "frontend/src/components/CtaButton.tsx": "Reusable orange affiliate CTA button with size variants.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright, attribution link, and product disclaimer.",
  "frontend/src/components/MobileStickyCtaBar.tsx": "Mobile-only sticky bottom bar containing a full‑width CTA button.",
  "frontend/src/components/sections/BenefitsSection.tsx": "Benefits grid with icons, lifestyle image, and CTA button.",
  "frontend/src/components/sections/FaqSection.tsx": "Renders a FAQ accordion with toggleable questions and answers for GutOptim.",
  "frontend/src/components/sections/FinalCtaSection.tsx": "Displays a final call‑to‑action section with headline, urgency note, CTA button, and product image.",
  "frontend/src/components/sections/FormulaSection.tsx": "Shows GutOptim’s ingredient highlights with icons and descriptions plus an accompanying image.",
  "frontend/src/components/sections/HeroSection.tsx": "Provides the main hero banner with product pitch, benefit bullets, CTA button, and product image.",
  "frontend/src/components/sections/ProblemSolutionSection.tsx": "Explains common digestive issues and positions GutOptim as the solution with supporting visuals and CTA.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays customer reviews with star ratings, supporting images, and a CTA button.",
  "frontend/src/components/sections/TrustQualitySection.tsx": "Lists trust and quality badges with icons and supporting image to reinforce product credibility.",
  "frontend/src/components/StickyHeader.tsx": "Sticky header with logo, smooth‑scroll navigation, mobile menu, and CTA button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user’s Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, identity loading, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom OKLCH color variables for light/dark themes, and component/utility classes for layout and styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, typography and animation extensions, plugins, and container settings.",
  "project_state.json": "Stores project metadata, requirements, architectural notes, and feature definitions for the GutOptim landing page."
}