{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "GutOptim premium single-page affiliate landing (conversion-focused, repeated orange CTAs)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a single-page premium, clean, trustworthy landing page with white base, mint/teal accents, modern sans typography, rounded cards, soft shadows, and spacious layout.",
      "acceptanceCriteria": [
        "Page uses a white base with mint/teal accents across sections (buttons excluded).",
        "Typography is a modern sans-serif with clear hierarchy (headline, subheadline, body).",
        "Cards across Benefits/Trust/Testimonials/FAQ use consistent border radius and soft shadow.",
        "Layout is spacious (consistent padding/margins) and avoids clutter."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Add Tailwind entry (if missing) plus global typography + spacing defaults to achieve the premium white + mint/teal look (buttons excluded), consistent rounded corners, soft shadows, and spacious layout across the page."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Implement the single-page GutOptim landing page composition (all required sections in order) with consistent container widths, spacing scale, and shared card styling classes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement a sticky header with text logo, anchor menu (smooth scroll), and orange Buy Now button linking to the affiliate URL.",
      "acceptanceCriteria": [
        "Header remains visible at the top while scrolling.",
        "Menu items scroll smoothly to the correct sections on click.",
        "Header Buy Now button is orange with high contrast and links exactly to the affiliate URL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StickyHeader.tsx",
          "operation": "create",
          "description": "Create a sticky header component with left text logo “GutOptim”, anchor links to #benefits #how-it-works #reviews #faq, and a right-aligned primary orange Buy Now CTA that links exactly to https://gutoptim24.com/text.php#aff=Nexora_8248."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Enable smooth scrolling behavior for in-page anchor navigation (and ensure scroll offset is handled cleanly with the sticky header)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire StickyHeader into the page layout and ensure each target section renders with the correct id anchors."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Build the HERO section with exact headline/subheadline, 3 trust bullets with icons, prominent orange CTA, and right-side product image using the provided URL.",
      "acceptanceCriteria": [
        "Hero headline and subheadline match the provided text exactly.",
        "Three trust bullets appear with simple icons.",
        "Hero Buy Now button is large, orange, high-contrast, with a slightly darker orange hover state, and links exactly to the affiliate URL.",
        "Hero image uses the provided URL and is positioned on the right on desktop and stacks appropriately on mobile."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "create",
          "description": "Implement HERO layout (copy left, image right) using exact headline/subheadline text, 3 trust bullets with simple inline icons, and an orange Buy Now CTA linking exactly to https://gutoptim24.com/text.php#aff=Nexora_8248. Use hero image URL: https://raw.githubusercontent.com/Automation8248/Digi-affiliate-blog-/main/images/gutoptim/images%20(1)%20(30).jpeg with consistent rounded styling."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add HeroSection at the top of the single-page layout (above the fold) and ensure responsive stacking on small screens."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a Problem → Solution section covering common gut issues with conservative wording, include orange CTA, and use the provided section image.",
      "acceptanceCriteria": [
        "Section copy covers bloating, gas, discomfort, and irregular digestion (no extreme medical promises).",
        "A CTA button appears under the section and links exactly to the affiliate URL.",
        "The section image uses the provided URL and has the same border radius styling used across the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/ProblemSolutionSection.tsx",
          "operation": "create",
          "description": "Create Problem → Solution section describing bloating, gas, discomfort, irregular digestion with mild, non-medical-claim wording; render the provided image https://raw.githubusercontent.com/Automation8248/Digi-affiliate-blog-/main/images/gutoptim/images%20(1)%20(31).jpeg with consistent rounded styling; include an orange CTA under the section linking exactly to https://gutoptim24.com/text.php#aff=Nexora_8248."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Insert ProblemSolutionSection directly after the hero section to follow the requested narrative flow."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add a Benefits section with exactly 6 benefit cards (specified titles), include an orange CTA after, and place the provided benefits image near the section.",
      "acceptanceCriteria": [
        "Exactly six benefit cards render with the specified titles.",
        "Cards use consistent rounded corners, soft shadows, and aligned grid spacing.",
        "A CTA button appears immediately after the benefits block and links exactly to the affiliate URL.",
        "The section image uses the provided URL and is placed adjacent to/near the benefits content (responsive)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/BenefitsSection.tsx",
          "operation": "create",
          "description": "Implement Benefits section with exactly six cards titled: Supports digestive comfort; Helps reduce bloating & gas; Supports gut balance; Supports healthy routine; Gentle daily support; Works with healthy lifestyle. Place image near section using https://raw.githubusercontent.com/Automation8248/Digi-affiliate-blog-/main/images/gutoptim/images%20(32).jpeg (responsive). Add an orange CTA immediately after benefits linking exactly to https://gutoptim24.com/text.php#aff=Nexora_8248. Ensure card styling matches global rounded/shadow rules."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render BenefitsSection with id=\"benefits\" to match header navigation and ensure CTA appears directly after the benefits block."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add a What’s Inside / Formula section with ingredient-style blocks, premium layout, conservative claims, and the provided image.",
      "acceptanceCriteria": [
        "Section presents ingredient-style blocks with conservative, non-medical-claim wording.",
        "The provided image is displayed within this section and styled consistently with other images (same border radius)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/FormulaSection.tsx",
          "operation": "create",
          "description": "Create a clean premium “What’s Inside / Formula” section using ingredient-style blocks (mild wording; avoid extreme medical promises) and display image https://raw.githubusercontent.com/Automation8248/Digi-affiliate-blog-/main/images/gutoptim/images%20(1)%20(29).jpeg with consistent rounded styling."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add FormulaSection and ensure it maps to the header’s “How It Works” anchor via id=\"how-it-works\" (as requested in header menu labels)."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add a Trust & Quality section with 4 badge cards (specified labels) and the provided image.",
      "acceptanceCriteria": [
        "Exactly four badge cards render with the specified labels.",
        "The provided image is displayed in the Trust & Quality section with consistent styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/TrustQualitySection.tsx",
          "operation": "create",
          "description": "Implement Trust & Quality section with exactly four badge cards: Quality tested; Secure checkout; Made in controlled facility; Fast shipping. Display image https://raw.githubusercontent.com/Automation8248/Digi-affiliate-blog-/main/images/gutoptim/images%20(34).jpeg with consistent border radius and aligned layout."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Place TrustQualitySection in the page flow after the formula section to reinforce credibility before reviews/CTA blocks."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add a Testimonials/Reviews section with 6 review cards (5 stars each), include orange CTA under reviews, and the provided image.",
      "acceptanceCriteria": [
        "Exactly six review cards render, each with a 5-star display and realistic short text.",
        "A CTA button appears under the review cards and links exactly to the affiliate URL.",
        "The provided image appears in this section and matches global image styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/TestimonialsSection.tsx",
          "operation": "create",
          "description": "Create Testimonials/Reviews section with exactly six realistic review cards, each showing ⭐⭐⭐⭐⭐ and short believable experiences (comfort, routine, feeling lighter). Include section image https://raw.githubusercontent.com/Automation8248/Digi-affiliate-blog-/main/images/gutoptim/images%20(33).jpeg and an orange CTA under the reviews linking exactly to https://gutoptim24.com/text.php#aff=Nexora_8248."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render TestimonialsSection with id=\"reviews\" to match header navigation and ensure the CTA appears directly under the reviews grid."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add an FAQ section with 6–8 questions (including four specified verbatim) using a clean expandable layout consistent with rounded cards.",
      "acceptanceCriteria": [
        "FAQ section contains between 6 and 8 questions.",
        "The four specified questions are included verbatim.",
        "FAQ items are readable and interactable (expand/collapse) and consistent with the rounded-card design."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/FaqSection.tsx",
          "operation": "create",
          "description": "Implement a conversion-friendly FAQ section (6–8 items) with expand/collapse interaction. Include the four required questions verbatim: “How to take GutOptim daily?”, “When will I notice results?”, “Is checkout secure?”, “How do I order?”. Style each item as a rounded card with soft shadow consistent with the rest of the page."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render FaqSection with id=\"faq\" to match header navigation and keep spacing consistent with surrounding sections."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add a final CTA section with exact headline/urgency text, big orange Buy Now button, and the provided image.",
      "acceptanceCriteria": [
        "Final CTA headline and urgency line match provided text exactly.",
        "Final Buy Now button is orange, large, high-contrast, has darker-orange hover, and links exactly to the affiliate URL.",
        "Final section image uses the provided URL and is styled consistently with other images."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/FinalCtaSection.tsx",
          "operation": "create",
          "description": "Create final CTA block with headline exactly “Take Control of Your Gut Health Today”, urgency line exactly “Limited availability — order now before stock runs out.”, a big orange Buy Now CTA linking exactly to https://gutoptim24.com/text.php#aff=Nexora_8248, and image https://raw.githubusercontent.com/Automation8248/Digi-affiliate-blog-/main/images/gutoptim/images%20(35).jpeg styled consistently (rounded radius)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Place FinalCtaSection as the closing section of the single-page layout."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Ensure all CTAs share the same orange primary style with darker hover and every CTA links exactly to the affiliate URL, including required CTA locations.",
      "acceptanceCriteria": [
        "All CTAs on the page link exactly to the affiliate URL (no exceptions).",
        "All CTAs share the same orange styling and hover behavior.",
        "CTAs are present in all required locations including a sticky mobile bottom bar."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CtaButton.tsx",
          "operation": "create",
          "description": "Create a reusable CTA button component that hardcodes/receives the affiliate URL (https://gutoptim24.com/text.php#aff=Nexora_8248) and enforces the shared orange styling, large size, high contrast, and slightly darker orange hover state used everywhere (Hero, after Benefits, after Testimonials, mobile bottom bar, Final CTA, and header)."
        },
        {
          "path": "frontend/src/components/StickyHeader.tsx",
          "operation": "modify",
          "description": "Update the header CTA to use the shared CtaButton styling/behavior to guarantee the exact URL and consistent hover state."
        },
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Use the shared CtaButton for the hero CTA to ensure identical styling and exact affiliate URL."
        },
        {
          "path": "frontend/src/components/sections/BenefitsSection.tsx",
          "operation": "modify",
          "description": "Use the shared CtaButton after the benefits grid to ensure identical styling and exact affiliate URL."
        },
        {
          "path": "frontend/src/components/sections/TestimonialsSection.tsx",
          "operation": "modify",
          "description": "Use the shared CtaButton under the reviews to ensure identical styling and exact affiliate URL."
        },
        {
          "path": "frontend/src/components/sections/FinalCtaSection.tsx",
          "operation": "modify",
          "description": "Use the shared CtaButton in the final CTA block to ensure identical styling and exact affiliate URL."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Implement a sticky mobile bottom Buy Now bar (small screens) with safe-area handling and non-obstructive spacing.",
      "acceptanceCriteria": [
        "On mobile viewport sizes, a sticky bottom bar is present during scroll.",
        "The bar includes an orange Buy Now button linking exactly to the affiliate URL.",
        "The bar does not cover essential content or create unusable overlap (content remains accessible)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MobileStickyCtaBar.tsx",
          "operation": "create",
          "description": "Create a mobile-only sticky bottom bar that stays visible while scrolling on small screens and contains a prominent orange Buy Now CTA linking exactly to https://gutoptim24.com/text.php#aff=Nexora_8248. Include safe-area padding and sizing so it doesn’t obstruct key content."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire MobileStickyCtaBar into the page layout and add bottom padding/margin to main content so the sticky bar never overlaps essential content."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Use all provided external image URLs in their exact sections and enforce consistent styling (border radius, sizing, grid alignment).",
      "acceptanceCriteria": [
        "Each section displays the exact specified image URL within that section.",
        "All section images share a consistent border radius and sizing rules.",
        "Images align to a consistent grid and do not appear in unintended sections."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Ensure the hero section uses only the specified hero image URL (30).jpeg and applies the shared image styling (consistent border radius, sizing, and alignment)."
        },
        {
          "path": "frontend/src/components/sections/ProblemSolutionSection.tsx",
          "operation": "modify",
          "description": "Ensure this section uses only the specified image URL (31).jpeg and applies the shared image styling (consistent border radius, sizing, and alignment)."
        },
        {
          "path": "frontend/src/components/sections/BenefitsSection.tsx",
          "operation": "modify",
          "description": "Ensure this section uses only the specified image URL (32).jpeg placed near benefits content and applies the shared image styling."
        },
        {
          "path": "frontend/src/components/sections/FormulaSection.tsx",
          "operation": "modify",
          "description": "Ensure this section uses only the specified image URL (29).jpeg and applies the shared image styling."
        },
        {
          "path": "frontend/src/components/sections/TrustQualitySection.tsx",
          "operation": "modify",
          "description": "Ensure this section uses only the specified image URL (34).jpeg and applies the shared image styling."
        },
        {
          "path": "frontend/src/components/sections/TestimonialsSection.tsx",
          "operation": "modify",
          "description": "Ensure this section uses only the specified image URL (33).jpeg and applies the shared image styling."
        },
        {
          "path": "frontend/src/components/sections/FinalCtaSection.tsx",
          "operation": "modify",
          "description": "Ensure this section uses only the specified image URL (35).jpeg and applies the shared image styling."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a shared, reusable global image presentation rule via utility composition (e.g., consistent radius/shadow behavior through consistent class conventions) to keep all section images visually consistent and aligned to the same grid."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Keep UX clean and fast: responsive layout, lightweight implementation (no heavy libraries), consistent spacing, and repeated CTAs for conversion.",
      "acceptanceCriteria": [
        "Page remains responsive (mobile/tablet/desktop) with no broken layout or overflow.",
        "No unnecessary heavy assets/animations are added that noticeably degrade load performance.",
        "Spacing is consistent and the page is free of clutter while still including repeated CTAs."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the overall layout is responsive (stacking, grid breakpoints, no overflow) and includes repeated CTAs in the required locations without adding extra heavy libraries or animations."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal, performance-friendly base styles (no large font files or heavy animations) and consistent spacing rules to support clean UX across breakpoints."
        }
      ]
    }
  ]
}